Revit 2027 API
AnalyticalElement.IsValidAnalyzeAs Method
 Checks whether the value set for Analyze As is valid for an Analytical Element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidAnalyzeAs(
	AnalyzeAs analyzeAs
)
Public Function IsValidAnalyzeAs (
	analyzeAs As AnalyzeAs
) As Boolean
public:
bool IsValidAnalyzeAs(
	AnalyzeAs analyzeAs
)
member IsValidAnalyzeAs :
        analyzeAs : AnalyzeAs -> bool
Parameters
analyzeAs AnalyzeAs
 The value set to be verified.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AnalyticalElement Class
Autodesk.Revit.DB.Structure Namespace